MAX_LEN_EMAIL = 254
"""Ограничивает количество символов в поле email."""

MAX_LEN_USER_INFO = 150
"""Ограничивает количество символов в полях информации о пользователе."""

MAX_LEN_TAG_NAME = 32
"""Ограничивает количество символов в поле названия Тега."""

MAX_LEN_INGREDIENT_NAME = 128
"""Ограничивает количество символов в поле названия Ингредиента."""

MAX_LEN_MEASURMENT_UNIT = 64
"""Ограничивает количество символов в поле названия Меры веса."""

MAX_LEN_RECIPE_NAME = 256
"""Ограничивает количество символов в поле названия Рецепта."""

PAGE_SIZE = 6
"""Определяет количество объектов на странице."""
